xiongGithub1/bootMin/MCAL364/TC36xA/_Reg/IfxDom_bf.h
/**
 * \file IfxDom_bf.h
 * \brief
 * \copyright Copyright (c) 2021 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC36XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Dom_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Dom_Registers
 * 
 */
#ifndef IFXDOM_BF_H
#define IFXDOM_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Dom_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEEN */
#define IFX_DOM_SCICTRL_PECON_PEEN_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.SETPE */
#define IFX_DOM_SCICTRL_PECON_SETPE_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PECON_Bits.PEACK */
#define IFX_DOM_SCICTRL_PECON_PEACK_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI0_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI0_P_OFF (0u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI1_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI1_P_OFF (1u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI2_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI2_P_OFF (2u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI3_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI3_P_OFF (3u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI4_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI4_P_OFF (4u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI5_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI5_P_OFF (5u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI6_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI6_P_OFF (6u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI7_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI7_P_OFF (7u)

/** \brief Length for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_LEN (1u)

/** \brief Mask for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_MSK (0x1u)

/** \brief Offset for Ifx_DOM_SCICTRL_PRIORITY_Bits.MCI8_P */
#define IFX_DOM_SCICTRL_PRIORITY_MCI8_P_OFF (8u)

